; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 876752 1 3 3 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	image1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Star4 image1)
	(have_image Star5 image1)
	(have_image Planet6 spectrograph0)
	(have_image Planet7 spectrograph0)
	(have_image Planet8 image1)
	(have_image Phenomenon9 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 star5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star5)
   goals met: 0 of 7
5. (take_image satellite0 star5 instrument1 image1)
   added: (have_image star5 image1)
   goals met: 1 of 7
6. (turn_to satellite0 star4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star4)
   goals met: 1 of 7
7. (take_image satellite0 star4 instrument1 image1)
   added: (have_image star4 image1)
   goals met: 2 of 7
8. (turn_to satellite0 star2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star2)
   goals met: 2 of 7
9. (turn_to satellite0 planet8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet8)
   goals met: 2 of 7
10. (take_image satellite0 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 3 of 7
11. (turn_to satellite0 star2 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star2)
   goals met: 3 of 7
12. (turn_to satellite0 phenomenon9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 7
13. (take_image satellite0 phenomenon9 instrument1 image1)
   added: (have_image phenomenon9 image1)
   goals met: 4 of 7
14. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 7
15. (turn_to satellite0 star2 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star2)
   goals met: 4 of 7
16. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 7
17. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 4 of 7
18. (turn_to satellite0 planet7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet7)
   goals met: 4 of 7
19. (take_image satellite0 planet7 instrument0 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 5 of 7
20. (turn_to satellite0 planet6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet6)
   goals met: 5 of 7
21. (take_image satellite0 planet6 instrument0 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 6 of 7
22. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   goals met: 7 of 7
